src/Reports/НоменклатураОборудования/НоменклатураОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>НоменклатураОборудования</name>
</mdclass:Report>

src/Catalogs/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заказы</name>
  <comment>Поставленные Заказы (по флотам РФ и по Заказчикам)</comment>
  <owners>Catalog.ПроектыКораблей</owners>
  <attributes>
    <name>БортовойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Флоты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостройки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Строитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТехническиеХарактеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиКораблей</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Вооружение</name>
    <attributes>
      <name>Вооружение</name>
      <type>
        <types>CatalogRef.ВооружениеКораблей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/НоменклатураОборудования/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьСписокПроектов();
	УстановитьЗначенияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрПриИзменении(Элемент)
	
	Если Элемент.Имя = "Страна" Тогда
	
		УстановитьСписокПроектов();
		Корабль = ЗаказыПустаяСсылка;
		ЗаводскойНомер = "";
		Система = СтруктураЗаказаПустаяСсылка;
		Оборудование = СтруктураЗаказаПустаяСсылка;
	
	КонецЕсли;
	
	УстановитьЗначенияПараметров();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокПроектов()
	
	Элементы.Проект.СписокВыбора.Очистить();
	Проект = Справочники.ПроектыКораблей.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(Страна) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Заказы.Владелец КАК Проект
	|ИЗ
	|	Справочник.Заказы КАК Заказы
	|ГДЕ
	|	Заказы.Заказчик В
	|			(ВЫБРАТЬ
	|				Флоты.Ссылка КАК Ссылка
	|			ИЗ
	|				Справочник.Флоты КАК Флоты
	|			ГДЕ
	|				Флоты.Страна = &Страна)";
	Запрос.УстановитьПараметр("Страна", Страна);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Элементы.Проект.СписокВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Проект"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПараметров()
	
	ПараметрыОтчета = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	
	УстановитьЗначениеПараметра(ПараметрыОтчета, "Страна");
	УстановитьЗначениеПараметра(ПараметрыОтчета, "Проект");
	УстановитьЗначениеПараметра(ПараметрыОтчета, "Корабль");
	УстановитьЗначениеПараметра(ПараметрыОтчета, "ЗаводскойНомер");
	УстановитьЗначениеПараметра(ПараметрыОтчета, "Система");
	УстановитьЗначениеПараметра(ПараметрыОтчета, "Изготовитель");
	УстановитьЗначениеПараметра(ПараметрыОтчета, "Оборудование");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПараметра(ПараметрыОтчета, ИмяПараметра)
	
	ПараметрОтчета = ПараметрыОтчета.Найти(ИмяПараметра);
	ПараметрОтчета.Использование = Истина;
	ПараметрОтчета.Значение = ЭтаФорма[ИмяПараметра];
	
КонецПроцедуры
